int global_var = 100;

void test_func(int global_var) { // پارامتر همنام با متغیر گلوبال (سایه‌زنی)
    int nn = 10;
    int y = 20;
    
    {
        int x = 20; // متغیر محلی جدید در بلاک داخلی (تداخل اسکوپ)
        {
            int x = 30; // بلاک داخلی‌تر
            // اگر بخواهیم 'x' این بلاک را تغییر دهیم، نباید روی xهای بیرون تاثیر بگذارد
        }
        x = x + 5;
    }
    
    nn = nn + global_var;
}

int main() {
    int global_var = 50; // متغیر محلی همنام با گلوبال در تابع main
    return 0;
}